EXPLANATION_TEMPLATES = {


    "high_accuracy":
        "برای دستیابی به دقت بالا مناسب است",


    "very_high_accuracy":
        "برای مسائل با نیاز به بالاترین دقت مناسب است",


    "handles_noise":
        "توانایی مدیریت داده‌های دارای نویز را دارد",


    "mixed_features":
        "برای داده‌هایی با ترکیب ویژگی‌های عددی و دسته‌ای مناسب است",


    "interpretable":
        "قابلیت تفسیر تصمیمات مدل بهتر است",


    "fast":
        "سرعت آموزش و پیش‌بینی بالاتری دارد",


    "high_dimension":
        "برای داده‌های با تعداد ویژگی زیاد مناسب است",

    "less_interpretable":
        "تفسیرپذیری آن کمتر از مدل‌های ساده است" ,

    "known_clusters":
        "وقتی تعداد گروه‌ها از قبل مشخص باشد، برای پیدا کردن گروه‌ها مناسب است",

    "unknown_clusters":
        "وقتی تعداد گروه‌ها مشخص نیست، می‌تواند تعداد مناسب گروه‌ها را پیدا کند",

    "irregular_shapes":
        "برای پیدا کردن گروه‌هایی با ساختارهای پیچیده و غیرمنظم مناسب است",

    "hierarchical_analysis":
        "امکان بررسی روابط بین گروه‌ها به صورت سلسله مراتبی را فراهم می‌کند",

    "small_dataset":
        "برای داده‌های با حجم کمتر عملکرد مناسبی دارد",

    "large_dataset":
        "برای داده‌های حجیم مناسب‌تر است",

    "numeric_features":
        "برای داده‌هایی که ویژگی‌های عددی دارند مناسب است",

    "parameter_sensitive":
        "نتیجه مدل به تنظیم دقیق پارامترها وابسته است",

    "requires_cluster_number":
        "نیاز دارد تعداد گروه‌ها از قبل مشخص شود",

    "slow_for_large_dataset":
        "برای داده‌های بزرگ ممکن است زمان اجرای بیشتری نیاز داشته باشد",

}