EXPLANATION_TEMPLATES = {


    "high_accuracy":
        "برای دستیابی به دقت بالا مناسب است",


    "very_high_accuracy":
        "برای مسائل با نیاز به بالاترین دقت مناسب است",


    "handles_noise":
        "توانایی مدیریت داده‌های دارای نویز را دارد",


    "mixed_features":
        "برای داده‌هایی با ترکیب ویژگی‌های عددی و دسته‌ای مناسب است",


    "interpretable":
        "قابلیت تفسیر تصمیمات مدل بهتر است",


    "fast":
        "سرعت آموزش و پیش‌بینی بالاتری دارد",


    "high_dimension":
        "برای داده‌های با تعداد ویژگی زیاد مناسب است",

    "less_interpretable":
        "تفسیرپذیری آن کمتر از مدل‌های ساده است" ,

}